title: GlobalProtect VPN Connection from Suspicious Client Version
id: 675fb788-3808-4a93-bdee-9600b2b27c50
status: experimental
description: | 
    Detects GlobalProtect authentication events from an unexpected client version. 
    This behavior was observed when using OpenConnect to establish a GlobalProtect tunnel connection.
    On gateway auth, OpenConnect is unaware of the GP Client version and reports a version of 0.0.0 or 0.0.-1
related:
    - id: 1b5fc48c-5e17-4b3a-9575-242ccfea7f16
      type: similar
    - id: 2a974294-09bc-4ec6-8b87-972b82c8de63
      type: similar 
references:
    - https://rotarydrone.medium.com/4a1d8fc7773e
tags:
    - attack.persistence
    - attack.lateral-movement
    - attack.t1133
    - attack.t1550.004
author: rotarydrone
date: 2024-08-29
modified: 2024-08-29
logsource:                      
    category: vpn
    product: globalprotect            
detection:
    eventtype:
        EventIDValue: 'gateway-auth'
    gpclientversion:
        GlobalProtectClientVersion|contains: '0.0.'
    condition: eventtype and gpclientversion
fields:
    - PublicIPv4
    - PublicIPv6
    - EndpointDeviceName
    - EndpointOSVersion
    - EndpointOSType
falsepositives:
    - unknown
level: medium