title: GlobalProtect VPN HIPMATCH with Empty Serial
id: 2a974294-09bc-4ec6-8b87-972b82c8de63
status: experimental
description: | 
    Detects GlobalProtect HIPMATCH events with an empty serial number. 
    This behavior was observed when using OpenConnect to establish a GlobalProtect tunnel connection.
related:
    - id: 1b5fc48c-5e17-4b3a-9575-242ccfea7f16
      type: similar
    - id: 675fb788-3808-4a93-bdee-9600b2b27c50
      type: similar 
references:
    - https://rotarydrone.medium.com/4a1d8fc7773e
tags:
    - attack.persistence
    - attack.lateral-movement
    - attack.t1133
    - attack.t1550.004
author: rotarydrone
date: 2024-08-29
modified: 2024-08-29
logsource:                      
    category: vpn
    product: globalprotect            
detection:
    eventtype:
        subtype: 'hipmatch'
    emptyserial:
        EndpointSerialNumber: null
    condition: eventtype and emptyserial
fields:
    - source_user
falsepositives:
    - unknown
level: medium